 [
    {
      "name": "La Genèse",
      "period": "3M d'année avant J-C",
      "desc": "Si nous n’avons pas de traces d’écriture musicale avant le Moyen Âge, nous savons, grâce aux instruments retrouvés lors des fouilles archéologiques, que la musique est née avec les premiers hommes (période paléolithique). Ces derniers s’inspiraient des sons qu’ils entendaient dans la nature. D’une part, les bruits produits par les quatre éléments : l’eau (pluie, vagues…) ; la terre (tremblements de terre, éboulis...) ; l’air (vent, tonnerre…) ; et le feu (incendies, craquements de branches…) ; d’autre part, les cris des animaux, et notamment les sifflements des oiseaux. ",
      "content" : [ "Les étapes biologiques qui ont jalonné le développement du chant et de la parole seraient les suivantes.",
        " ",
        "Le genre biologique Homo apparaît au Paléolithique inférieur il y a environ 2,8 millions d'années en Éthiopie.",
        "Il y a 1,5 à 1,7 million d'années, la morphologie de l'oreille interne et du larynx d'Homo ergaster témoigne déjà de capacités vocales plus étendues que chez Homo habilis55.",
        "Le contrôle fin de l'expiration, la possibilités de longues vocalisations et la capacité de gérer des séquences complexes apparaissent chez un ancêtre commun à Homo neanderthalensis et Homo sapiens31, il y a plus de 700 000 ans.",
        "Il y a 300 000 ans au plus tard, l'anatomie essentiellement moderne des humains — Homo sapiens archaïques et descendants d'espèces plus anciennesnote 6 —, permet une gamme étendue de sons et le contrôle de la durée31.",
        "Le premier os hyoïde néandertalien bien conservé — celui du fossile Kebara 2 découvert dans la grotte de Kébara en Israël avec une industrie moustérienne — date d'il y a 60 000 ans et présente déjà la forme moderne de l'os hyoïde ce qui montre que la morphologie physique qui permet le langage articulé est déjà pleinement développée au Paléolithique moyen9,56.",
        "Instruments à vent",
        "",
        "Rhombe mésolithique (à gauche57). Kreismuseum Jerichower Land (de).",
        "Parmi les instruments à vent préhistoriques les plus connus, on peut citer :",
        "",
        "la flûte en os de cygne à trois trous de Geissenklösterle, datée de 42 000 à 43 000 ans avant le présent,",
        "la flûte en ivoire de mammouth de Geissenklösterle,",
        "la flûte en os de vautour à cinq trous de Hohle Fels, vers 35 000,",
        "la flûte en os de vautour d'Isturitz, vers 35 000, et d'autres flûtes plus récentes,",
        "la phalange sifflante à deux trous de la Quina,",
        "la phalange sifflante d'Aurignac, la première découverte mais pas la plus ancienne,",
        "d'autres phalanges sifflantes dont celles de Laugerie-Haute et Laugerie-Basse,",
        "la flûte en os de fou de Bassan de la grotte de Tore,",
        "les rhombes pavloviens de Moravie,",
        "les rhombes solutréens de Lespugue et de Badegoule,",
        "les rhombes magdaléniens de Lalinde et de Laugerie-Basse,",
        "la conque magdalénienne de Marsoulas,",
        "le rhombe mésolithique de Pritzerbe57, conservé au Kreismuseum Jerichower Land (de) à Genthin (Saxe-Anhalt),",
        "les cornes représentées sur des fresques néolithiques de Çatal Höyük, environ 9 500 ans avant le présent,",
        "la flûte en os néolithique de Jiahu dans le Henan, culture de Peiligang,",
        "les sifflets en os néolithiques du Zhejiang, culture de Hemudu,",
        "le xun de Banpo, culture de Yangshao,",
        "le joueur d'aulos de Kéros, statuette du Cycladique ancien,",
        "la première mention écrite d'une flûte dans une tablette sumérienne, vers 2600-2500 av. J.-C.51,",
        "les flûtes à sept trous de la civilisation de la vallée de l'Indus,",
        "le groupe de six flûtes en bois d'if des Wicklow.",
        "Instruments de percussion",
        "Parmi les instruments de percussion préhistoriques les plus connus, on peut citer :",
        "",
        "le possible racleur moustérien en os de mammouth de Schulen[précision nécessaire]58,",
        "peut-être la corne de bison striée (possible racleur gravettien ?) de la Vénus de Laussel28,",
        "le racleur magdalénien de Pekarna en Moravie59,",
        "le racleur magdalénien de l'abri Lafaye à Bruniquel59,",
        "le racleur magdalénien du Mas-d'Azil,",
        "le « lithophone naturel » de la grotte Cosquer14,",
        "d'autres lithophones naturels dans des grottes ornées en Espagne et en France[précision nécessaire],",
        "le double bâton (possible racleur néolithique ?) représenté sur des fresques de Çatal Höyük, environ 9 500 ans avant le présent,",
        "les lithophones néolithiques sahariens, âgés de 10 000 à 4 500 ans20,",
        "les pierres sonores qing et les tambours de Yin Xu à Anyang dans le Henan.",
        "Instruments à cordes",
        "Parmi les instruments à cordes préhistoriques les plus connus, on peut citer :",
        "",
        "un arc musical aurignacien à Geissenklösterle ?[à vérifier],",
        "le possible double arc musical représenté sur des fresques de Çatal Höyük, environ 9 500 ans avant le présent,",
        "les premières cithares qin et les zheng en Chine,",
        "le harpiste de Kéros, statuette du Cycladique ancien,",
        "les pré-ravanhatta de la civilisation de la vallée de l'Indus,",
        "etc."],
      "icon": "images/genese.png",
      "source": "../sons/oiseauxpréhistoire.mp3",
      
      "favorited": false
    },
    {
      "name": "Le Moyen Âge ",
      "period": "Ve-XVe siècle",
      "desc": "Durant de nombreux siècles, la musique s’est exclusivement transmise via la tradition orale. Les difficultés de mémorisation et de diffusion des mélodies et des chants vont progressivement favoriser l’émergence d’un codage musical, qui va permettre de conserver une trace écrite : c’est la naissance des premières partitions. Au IXe siècle apparaissent les « neumes » (du grec neuma, « signe »), qui sont les ancêtres des notes : ce sont de petits signes placés au-dessus des paroles dans le but de donner des indications sur la mélodie.",
      "icon": "images/moyen_age.png",
      "source": "../sons/gregorian-chant-te-deum.mp3",
      "url": "https://www.youtube.com/watch?v=Lin-a2lTelg",
      "favorited": false
    },
    {
      "name": "La Renaissance",
      "period": "XVe-XVIIe siècle",
      "desc":"La musique Renaissance couvre environ deux siècles. Elle se situe entre le Moyen Âge et le style baroque, c’est-à-dire de la deuxième moitié du XVe siècle jusqu’à la moitié du XVIIe siècle. L’époque baroque se termine en 1750, à la mort de Jean-Sébastien Bach. Au XVIe siècle, la musique commence à s’éloigner de l’Église, qui perd progressivement son pouvoir absolu. Elle est envisagée comme un divertissement qui s’adresse aussi aux hommes (les œuvres musicales étaient jusqu’alors exclusivement des œuvres religieuses, destinées à la gloire de Dieu). La musique acquiert une plus grande liberté d’expression et une diversité de thèmes : on parle alors de « renaissance musicale ». L’imprimerie va, en parallèle, permettre une diffusion plus rapide et efficace des œuvres composées, qui ne cessent de s’enrichir. De nombreux instruments de musique sont également créés durant la Renaissance parmi lesquels : la viole de gambe, la lyre, le luth, la vielle ou la harpe.",
      "icon": "images/renaissance.png",
      "source": "../sons/orfeo-extraits.mp3",
      "url": "https://www.youtube.com/watch?v=ICjyAe9S54c",
      "favorited": false
    },
    {
      "name": "La période classique",
      "period": "XVIIe-XIXe siècle",
      "desc":"La période dite « classique » va s’étendre de la seconde moitié du XVIIIe siècle jusqu’au tout début du XIXe siècle. Trait d’union entre la période baroque et la période romantique, c’est l’âge d’or de la musique instrumentale, avec l’apparition de nouveaux instruments, comme le piano-forte. Celui-ci détrônera progressivement le clavecin en raison de ses qualités expressives.",
      "icon": "images/classic.png",
      "source": "../sons/euronews-le-mag-le-piano-forte-de-mozart.mp3",
      "url": "https://www.youtube.com/watch?v=kYgGwWYOd9Y",
      "favorited": false
    },
    {
      "name": "L’époque romantique",
      "period": "XIXe-XXe siècle",
      "desc": "Cette période couvre la majeure partie du XIXe siècle. Beethoven (1770-1827) assure la transition avec la période classique en repoussant les limites formelles exprimées précédemment. La musique classique était légère, sereine, la musique romantique sera passionnée. On y exprime ses sentiments : joie, tristesse, désespoir, colère, maladie, révolte, exaltation... Les tourments de l’âme, l’imaginaire et la sensibilité l’emportent sur la raison. Le piano, qui est l’instrument roi de cette époque, permet d’exprimer toute la palette de ces différents sentiments. Les compositeurs s’inspirent également de grands textes romantiques pour composer leur musique, tels que ceux de Goethe ou Shakespeare. Parmi les musiciens phares de cette époque, citons Chopin, Liszt, Brahms, Schubert et Schumann.",
      "icon": "images/romantique.png",
      "source": "../sons/chopin-nocturne-no-20-perf-by-wladyslaw-szpilman-the-pianist-original-recording.mp3",
      "url": "https://www.youtube.com/watch?v=0WlpALnQdN8",
      "favorited": false
    },
    {
      "name": "L’époque moderne",
      "period": "XXe siècle",
      "desc": " On applique ce terme à la première partie du XXe siècle. Il n’y a pas vraiment d’unité musicale à cette période, l’idée des compositeurs étant de se libérer des modèles précédents et de trouver de nouvelles règles. La musique comme la société se modernisent. Cette époque débute avec ce qu’on appellera le « post-romantisme » : Debussy et Ravel en sont l’incarnation.",
      "icon": "/images/moderne.png",
      "source": "https://raw.githubusercontent.com/muhammederdem/mini-player/master/mp3/6.mp3",
      "url": "https://www.youtube.com/watch?v=HhoATZ1Imtw",
      "favorited": false
    },
    {
      "name": "L’époque contemporaine",
      "period": "XXIe siècle",
      "desc": "Cette période commence dans la deuxième partie du XXe siècle. Il devient difficile de donner une tendance puisque plusieurs formes de langages vont coexister. La révolution musicale se poursuit, notamment avec le compositeur autrichien Arnold Schönberg (1874-1951), qui fut le premier à s’affranchir de la musique tonale. Rappelons que la tonalité est la note de référence autour de laquelle sont écrites les autres notes. C’est ce qui donne une couleur au morceau (on parle par exemple d’une œuvre en sol mineur). Avec Schönberg, ce système éclate. Il n’y a plus de tonalité mais un système de douze sons, le « dodécaphonisme », qui permet d’organiser un cadre formel à ces sons et qui se substitue au système tonal (tous les sons sont égaux) : c’est la naissance de la « musique sérielle ». Citons l’une de ses œuvres les plus connues : Pierrot lunaire.",
      "icon": "/images/contemporaine.png",
      "source": "https://raw.githubusercontent.com/muhammederdem/mini-player/master/mp3/7.mp3",
      "url": "https://www.youtube.com/watch?v=me6aoX0wCV8",
      "favorited": true
    },
    {
      "name": "Demain",
      "period": "XXIIe-... siècle",
      "desc": " Cette Période débute demain et nous avons bien hâte de voir ce qu'elle nous réserve comme nouveau genre de music mais surtout comment les jeunes d'aujourd'hui seront des ringards de demain.",
      "icon": "images/music.png",
      "source": "../sons/cymatics-science-vs-music-nigel-stanford.mp3",
      "url": "https://www.youtube.com/watch?v=me6aoX0wCV8",
      "favorited": true
    }
  ]